Core/src/Documents/Конвертация/Конвертация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Конвертация</name>
  <registerRecords>InformationRegister.ОтчетПоКурсовымРазницам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПодотчетниками</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКонвертация</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтправитель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПолучатель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКлючВИнтернетБанке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/InformationRegisters/УИДДокументовВИнтернетБанке/УИДДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УИДДокументовВИнтернетБанке</name>
  <resources>
    <name>УИДДокументаВБанке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ПлатежнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/СтатусыДокументовВИнтернетБанке/СтатусыДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДокументовВИнтернетБанке</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокументаВИнтернетБанке</name>
    <type>
      <types>EnumRef.СтатусыДокументовВИнтернетБанке</types>
      <types>EnumRef.СтатусыПакетныхПеречисленийВИнтернетБанке</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ПлатежнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ПрименениеПереводовВПути/ПрименениеПереводовВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрименениеПереводовВПути</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика</name>
    <type>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.ВидыНалогов</types>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>ChartOfAccountsRef.Управленческий</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Контрагенты</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.АналитикаДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РасчетыСПодотчетниками/РасчетыСПодотчетниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПодотчетниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/СтатусыДокументовВИнтернетБанке/СтатусыДокументовВИнтернетБанке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовВИнтернетБанке</name>
  <enumValues>
    <name>C</name>
  </enumValues>
  <enumValues>
    <name>N</name>
  </enumValues>
  <enumValues>
    <name>D</name>
  </enumValues>
  <enumValues>
    <name>P</name>
  </enumValues>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
  <enumValues>
    <name>T</name>
  </enumValues>
  <enumValues>
    <name>R</name>
  </enumValues>
  <enumValues>
    <name>Z</name>
  </enumValues>
  <enumValues>
    <name>ПрисутствуетТолькоВТекущейБазе</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженИзИнтернетБанка</name>
  </enumValues>
  <enumValues>
    <name>INIT</name>
  </enumValues>
  <enumValues>
    <name>DR</name>
  </enumValues>
  <enumValues>
    <name>G</name>
  </enumValues>
  <enumValues>
    <name>WC</name>
  </enumValues>
  <enumValues>
    <name>CERT</name>
  </enumValues>
  <enumValues>
    <name>VERIF</name>
  </enumValues>
  <enumValues>
    <name>CPE</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>F</name>
  </enumValues>
  <enumValues>
    <name>FL</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийКонвертация/ВидыОперацийКонвертация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКонвертация</name>
  <enumValues>
    <name>Касса</name>
  </enumValues>
  <enumValues>
    <name>Подотчетник</name>
  </enumValues>
  <enumValues>
    <name>СоСчета</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/Конвертация/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаИнициализироватьДанныеДокумента());
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКонвертация);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаОтправитель", ДокументСсылкаКонвертация.ВалютаОтправитель);
	Запрос.УстановитьПараметр("ВалютаПолучатель", ДокументСсылкаКонвертация.ВалютаПолучатель);
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	Запрос.ВыполнитьПакет();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_Конвертация(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредства(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОтчетПоКурсовымРазницам(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

Функция ТекстЗапросаИнициализироватьДанныеДокумента()
	
	Возврат
	"ВЫБРАТЬ
	|	Конвертация.Ссылка,
	|	ИспользоватьЗагрузкуИзБанка.Значение КАК ИспользоватьИнтеграциюСБанком,
	|	ЕСТЬNULL(СтатусыДокументовВИнтернетБанке.СтатусДокументаВИнтернетБанке, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовВИнтернетБанке.ПрисутствуетТОлькоВТекущейБазе)) КАК СтатусВИнтернеБанке,
	|	ЕСТЬNULL(УИДДокументовВИнтернетБанке.УИДДокументаВБанке, """") КАК УИДВИнтернетБанке,
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.видыоперацийконвертация.сосчета)
	|			ТОГДА Конвертация.Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БанкИспользуетсяДляИнтеграцииСБанком,
	|	Конвертация.ВидОперации
	|ПОМЕСТИТЬ ВременнаяТаблицаДанныеИнтернетБанка
	|ИЗ
	|	Константа.ИспользоватьЗагрузкуИзБанка КАК ИспользоватьЗагрузкуИзБанка,
	|	Документ.Конвертация КАК Конвертация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УИДДокументовВИнтернетБанке КАК УИДДокументовВИнтернетБанке
	|		ПО Конвертация.Ссылка = УИДДокументовВИнтернетБанке.ДокументСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовВИнтернетБанке.СрезПоследних КАК СтатусыДокументовВИнтернетБанке
	|		ПО Конвертация.Ссылка = СтатусыДокументовВИнтернетБанке.ДокументСсылка
	|ГДЕ
	|	Конвертация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДанныеИнтернетБанка.Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ВременнаяТаблицаДанныеИнтернетБанка.ИспользоватьИнтеграциюСБанком
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВременнаяТаблицаДанныеИнтернетБанка.ВидОперации = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВИДЫОПЕРАЦИЙКОНВЕРТАЦИЯ.СОСЧЕТА)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НЕ ВременнаяТаблицаДанныеИнтернетБанка.БанкИспользуетсяДляИнтеграцииСБанком
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВременнаяТаблицаДанныеИнтернетБанка.СтатусВИнтернеБанке = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СТАТУСЫДОКУМЕНТОВВИНТЕРНЕТБАНКЕ.S)
	|										ИЛИ ВременнаяТаблицаДанныеИнтернетБанка.СтатусВИнтернеБанке = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СТАТУСЫДОКУМЕНТОВВИНТЕРНЕТБАНКЕ.P)
	|										ИЛИ ВременнаяТаблицаДанныеИнтернетБанка.СтатусВИнтернеБанке = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СТАТУСЫДОКУМЕНТОВВИНТЕРНЕТБАНКЕ.зАГРУЖЕНИЗИНТЕРНЕТБАНКА)
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СформироватьПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаПроверкиИНтернетБанка
	|ИЗ
	|	ВременнаяТаблицаДанныеИнтернетБанка КАК ВременнаяТаблицаДанныеИнтернетБанка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаОтправитель, &ВалютаПолучатель, &ВалютаУчета, &ВалютаНациональная)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Конвертация.Номер,
	|	Конвертация.Дата,
	|	Конвертация.Организация,
	|	Конвертация.ВидОперации,
	|	Конвертация.Отправитель,
	|	Конвертация.Получатель,
	|	Конвертация.ВалютаОтправитель,
	|	Конвертация.ВалютаПолучатель,
	|	Конвертация.СуммаКонвертации КАК СуммаКонвертацииВал,
	|	Конвертация.СуммаПолучено КАК СуммаПолученоВал,
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА Конвертация.Отправитель.СчетУчетаРегл
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА Конвертация.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|	КОНЕЦ КАК ОтправительСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА Конвертация.Получатель.СчетУчетаРегл
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА Конвертация.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|	КОНЕЦ КАК ПолучательСчетУчетаРегл,
	|	Конвертация.Статья,
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель * Конвертация.КратностьОтправитель / Конвертация.КурсПолучатель * Конвертация.КратностьПолучатель КАК ЧИСЛО(15, 2)) КАК СуммаОтправительВалПолучатель,
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоБанковскийСчет,
	|	Конвертация.КурсОтправитель,
	|	Конвертация.КурсПолучатель,
	|	Конвертация.КратностьОтправитель,
	|	Конвертация.КратностьПолучатель,
	|	Конвертация.Подотчетник,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	Выбор 
	|		Когда Конвертация.Проект = Значение(Справочник.Проекты.ПустаяСсылка)
	|			Тогда Значение(Справочник.Проекты.БезПроекта)
	|		Иначе Конвертация.Проект
	|	Конец КАК Проект,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15, 2)) КАК СуммаОтправительРегл,
	|	ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15, 2)) КАК СуммаПолучательРегл,
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15, 2)) КАК СуммаОтправительУпр,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА Конвертация.СуммаКонвертации
	|		ИНАЧЕ ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПолучательУпр,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РазницаРегл,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РазницаУпр,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) / (втВалютаПолучатель.Курс * втВалютаПолучатель.Кратность) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РазницаОтправитель,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) / (втВалютаПолучатель.Курс * втВалютаПолучатель.Кратность) КАК ЧИСЛО(15, 2)) КАК ЧИСЛО(15,2))
	|	КОНЕЦ КАК РазницаПолучатель,
	|	(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2))) = Конвертация.СуммаПолучено КАК БезКурсовыхРазниц
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.Конвертация КАК Конвертация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК втНацВалюта
	|		ПО (втНацВалюта.Валюта = &ВалютаНациональная)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК втВалютаУчета
	|		ПО (втВалютаУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК втВалютаОтправитель
	|		ПО Конвертация.ВалютаОтправитель = втВалютаОтправитель.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК втВалютаПолучатель
	|		ПО Конвертация.ВалютаПолучатель = втВалютаПолучатель.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПроверкиИНтернетБанка КАК ВременнаяТаблицаПроверкиИНтернетБанка
	|		ПО Конвертация.Ссылка = ВременнаяТаблицаПроверкиИНтернетБанка.Ссылка
	|ГДЕ
	|	Конвертация.Ссылка = &Ссылка
	|	И ВременнаяТаблицаПроверкиИНтернетБанка.СформироватьПроводки
	|
	|СГРУППИРОВАТЬ ПО
	|	Конвертация.ВалютаОтправитель,
	|	Конвертация.Получатель,
	|	Конвертация.ВидОперации,
	|	Конвертация.Дата,
	|	Конвертация.Организация,
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА Конвертация.Получатель.СчетУчетаРегл
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА Конвертация.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|	КОНЕЦ,
	|	Конвертация.Статья,
	|	Конвертация.Номер,
	|	Конвертация.Подотчетник,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	Выбор 
	|		Когда Конвертация.Проект = Значение(Справочник.Проекты.ПустаяСсылка)
	|			Тогда Значение(Справочник.Проекты.БезПроекта)
	|		Иначе Конвертация.Проект
	|	Конец,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА Конвертация.Отправитель.СчетУчетаРегл
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА Конвертация.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|	КОНЕЦ,
	|	Конвертация.Отправитель,
	|	Конвертация.ВалютаПолучатель,
	|	Конвертация.СуммаКонвертации,
	|	Конвертация.СуммаПолучено,
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель * Конвертация.КратностьОтправитель / Конвертация.КурсПолучатель * Конвертация.КратностьПолучатель КАК ЧИСЛО(15, 2)),
	|	ВЫБОР
	|		КОГДА Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|				ИЛИ Конвертация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Конвертация.КурсОтправитель,
	|	Конвертация.КурсПолучатель,
	|	Конвертация.КратностьОтправитель,
	|	Конвертация.КратностьПолучатель,
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15, 2)),
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА Конвертация.СуммаКонвертации
	|		ИНАЧЕ ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втВалютаУчета.Кратность) / (втВалютаУчета.Курс * Конвертация.КратностьПолучатель) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) / (втВалютаОтправитель.Курс * втВалютаОтправитель.Кратность) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) / (втВалютаПолучатель.Курс * втВалютаПолучатель.Кратность) КАК ЧИСЛО(15,2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2))) = Конвертация.СуммаПолучено,
	|	ВЫБОР
	|		КОГДА Конвертация.СуммаПолучено = (ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * Конвертация.КурсОтправитель / Конвертация.КурсПолучатель КАК ЧИСЛО(15, 2)))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(Конвертация.СуммаКонвертации * (Конвертация.КурсОтправитель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьОтправитель) КАК ЧИСЛО(15,2)) - ВЫРАЗИТЬ(Конвертация.СуммаПолучено * (Конвертация.КурсПолучатель * втНацВалюта.Кратность) / (втНацВалюта.Курс * Конвертация.КратностьПолучатель) / (втВалютаПолучатель.Курс * втВалютаПолучатель.Кратность) КАК ЧИСЛО(15, 2)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ";
	
КонецФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредства(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКонвертация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходДенежныхСредств", НСтр("ka='ფულადი სახსრების დანახარჯი';ru='Расход денежных средств'"));
	Запрос.УстановитьПараметр("ПеремещениеДенежныхСредств", НСтр("ka='ფულადი სახსრების გადაადგილება';ru='Перемещение денежных средств'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользуютсяПереводыВПути",РегистрыСведений.ПрименениеПереводовВПути.ИспользуютсяПереводыВПути(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата,СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь"));
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	""Конвертация"" КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные)
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Отправитель КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.Отправитель КАК Аналитика,
	|	ТаблицаДокумента.ВалютаОтправитель КАК Валюта,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	ТаблицаДокумента.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ТаблицаДокумента.СуммаОтправительУпр КАК Сумма,
	|	ТаблицаДокумента.СуммаКонвертацииВал КАК СуммаВал,
	|	0 КАК СуммаДляОстатка,
	|	0 КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.Отправитель.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.Отправитель.СчетУчетаРегл КАК СчетУчетаРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	""Конвертация"",
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные)
	|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОНЕЦ,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Получатель,
	|	ТаблицаДокумента.Получатель,
	|	ТаблицаДокумента.ВалютаПолучатель,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	ТаблицаДокумента.Проект,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ТаблицаДокумента.СуммаПолучательУпр,
	|	ТаблицаДокумента.СуммаПолученоВал,
	|	0,
	|	0,
	|	ТаблицаДокумента.Отправитель.СчетУчета,
	|	ТаблицаДокумента.Отправитель.СчетУчетаРегл
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДенежныеСредства.Организация КАК Организация,
	|	ВременнаяТаблицаДенежныеСредства.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВременнаяТаблицаДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВременнаяТаблицаДенежныеСредства.Валюта КАК Валюта,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	ВременнаяТаблицаДенежныеСредства.Проект КАК Проект
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ВременнаяТаблицаДенежныеСредства";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредства(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыДенежныеСредстваРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства)
	
	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОтражениеРасходов", НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	ТаблицаДокумента.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ТаблицаДокумента.Получатель.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.Получатель.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Получатель КАК Аналитика,
	|	&ОтражениеРасходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов,
	|	ВЫРАЗИТЬ(РазницаОтправитель * -1 КАК ЧИСЛО(15, 2)) КАК СуммаРасходов,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.РазницаУпр * -1 КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.Получатель.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДокумента.Получатель.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ИЛИ ТаблицаДокумента.Получатель.СчетУчетаРегл В (&СчетаФинРезРасходы))
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса))
	|	И ТаблицаДокумента.РазницаУпр < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	//ПодольскийАИ #УчетПроектов 21.04.2021 {
	|	ТаблицаДокумента.Проект КАК Проект,
	//ПодольскийАИ #УчетПроектов 21.04.2021 }
	|	ТаблицаДокумента.Получатель.СчетУчета,
	|	ТаблицаДокумента.Получатель.СчетУчетаРегл,
	|	ТаблицаДокумента.Получатель,
	|	&ОтражениеРасходов,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.РазницаОтправитель КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.РазницаУпр КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.Отправитель.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДокумента.Отправитель.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|			ИЛИ ТаблицаДокумента.Отправитель.СчетУчетаРегл В (&СчетаФинРезРасходы))
	|	И (ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета)
	|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Касса))
	|	И ТаблицаДокумента.РазницаУпр > 0";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТаблицаДоходыИРасходы);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКонвертация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеДолгаПодотчетника", НСтр("ka='საქვეანგარიშო პირის ვალის წარმოშობა';ru='Возникновение долга подотчетника'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ВалютаУчета",	Константы.ВалютаУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&ВозникновениеДолгаПодотчетника КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Получатель КАК БанковскийСчет,
	|	&Ссылка КАК Документ,
	|	ТаблицаДокумента.Подотчетник КАК Сотрудник,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВалютаПолучатель КАК Валюта,
	|	СУММА(ТаблицаДокумента.СуммаПолучательУпр) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаПолученоВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.СуммаПолучательУпр) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаПолученоВал) КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками КАК СчетУчета,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл КАК СчетУчетаРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Получатель,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВалютаПолучатель,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	&ВозникновениеДолгаПодотчетника,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Получатель,
	|	&Ссылка,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.Дата,
	|	&Организация,
	|	ТаблицаДокумента.ВалютаОтправитель,
	|	СУММА(ТаблицаДокумента.СуммаОтправительУпр),
	|	СУММА(ТаблицаДокумента.СуммаКонвертацииВал),
	|	СУММА(ТаблицаДокумента.СуммаОтправительУпр),
	|	СУММА(ТаблицаДокумента.СуммаКонвертацииВал),
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Получатель,
	|	ТаблицаДокумента.Подотчетник,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.ВалютаОтправитель,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Подотчетник.СчетРасчетовСПодотчетникамиРегл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Валюта,
	|	Документ,
	|	СчетУчета,
	|	СчетУчетаРегл";//+++
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с подотчетными лицами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Валюта КАК Валюта,
	|	ВременнаяТаблицаРасчетыСПодотчетниками.Документ КАК Документ
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПодотчетниками КАК ВременнаяТаблицаРасчетыСПодотчетниками";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПодотчетниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетниками(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПодотчетникамиРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПодотчетниками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтчетПоКурсовымРазницам(ДокументСсылкаКонвертация, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	1 КАК НомерСтроки,
		|	ТаблицаДокумента.Дата КАК Период,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.Статья КАК Статья,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.Подотчетник)
		|			ТОГДА ТаблицаДокумента.Подотчетник
		|		ИНАЧЕ ТаблицаДокумента.Отправитель
		|	КОНЕЦ КАК Аналитика,
		|	ТаблицаДокумента.ВалютаОтправитель КАК Валюта,
		|	""Денежные средства"" КАК Раздел,
		|	ТаблицаДокумента.РазницаУпр КАК Сумма,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.РазницаУпр < 0
		|			ТОГДА -ТаблицаДокумента.РазницаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДоходов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.РазницаУпр < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаДокумента.РазницаУпр
		|	КОНЕЦ КАК СуммаРасходов,
		|	ТаблицаДокумента.СуммаОтправительУпр КАК СуммаОстаток,
		|	ТаблицаДокумента.СуммаПолучательУпр КАК СуммаВалОстаток
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.РазницаУпр <> 0";
		//|			ИЛИ ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКонвертация.СоСчета))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтчетКурсовыхРазниц", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
